app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" DESC
---
  def index
    @tasks = Task.all.order(:completion_date).reverse_order

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id].to_i)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Learning Rails 5"], ["description", "Read and Understand"], ["created_at", "2018-09-20 16:48:09.061231"], ["updated_at", "2018-09-20 16:48:09.061231"]]
---
    task = Task.new(task_params)

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Read and take notes"], ["updated_at", "2018-09-21 20:24:01.518977"], ["id", 12]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "At least this many ounces per day"], ["updated_at", "2018-09-20 16:46:32.792690"], ["id", 11]]
---
    task = Task.find(params[:id].to_i)
    task.update(task_params)

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "status" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completion_date", "2018-09-20"], ["status", "Unmark Complete"], ["updated_at", "2018-09-20 02:45:40.360912"], ["id", 3]]
---
    task = Task.find(params[:id].to_i)
    if task.completion_date == nil
      task.completion_date = Date.current
      task.status = "Unmark Complete"
    else
      task.completion_date = nil
      task.status = "Mark Complete"
    end

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
---
    task = Task.find_by(id: params[:id].to_i)
    task.destroy